Revit 2027 API
RoutingPreferenceRule.RoutingPreferenceManager Property
 Gets the routing preference manager that owns this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoutingPreferenceManager RoutingPreferenceManager { get; }
Public ReadOnly Property RoutingPreferenceManager As RoutingPreferenceManager
	Get
public:
property RoutingPreferenceManager^ RoutingPreferenceManager {
	RoutingPreferenceManager^ get ();
}
member RoutingPreferenceManager : RoutingPreferenceManager with get
Property Value
RoutingPreferenceManager
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace